src/infraestrutura/docker compose/Hosts/SIGAA_HEALTH_CHECK/app/controllers/home_controller.rb

SELECT "apps".* FROM "apps" WHERE "apps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @AppStatus = App.find_by(id: 1)

SELECT "apps".* FROM "apps" ORDER BY "apps"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "apps" SET "server" = ?, "updated_at" = ? WHERE "apps"."id" = ?  [["server", "DOWN"], ["updated_at", "2026-06-02 21:11:31.882738"], ["id", 1]]
UPDATE "apps" SET "db" = ?, "updated_at" = ? WHERE "apps"."id" = ?  [["db", "DOWN"], ["updated_at", "2026-06-20 23:48:28.309419"], ["id", 1]]
---
  def change
    app = App.first

    type = params[:type]
    status = params[:status]

    if type == "server"
      app.update(server: status)
    elsif type == "database"
      app.update(db: status)

SELECT "apps".* FROM "apps" ORDER BY "apps"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def health
      app = App.first